---
type: PropertySetElement
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# PropertySetElement

`Autodesk.Revit.DB.PropertySetElement` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | Duplicate | 2012 | `public PropertySetElement Duplicate ( Document document , string name )` |
| Method | GetStructuralAsset | 2012 | `public StructuralAsset GetStructuralAsset ()` |
| Method | GetThermalAsset | 2012 | `public ThermalAsset GetThermalAsset ()` |
| Method | SetStructuralAsset | 2012 | `public void SetStructuralAsset ( StructuralAsset structuralAsset )` |
| Method | SetThermalAsset | 2012 | `public void SetThermalAsset ( ThermalAsset thermalAsset )` |
| Property | Parameter | — | `` |